Revit 2027 API
FamilyInstance.FromRoom Property
The "From Room" set for the door or window.
Overload List
Name | Description
FromRoom | The "From Room" set for the door or window in the last phase of the project.
FromRoom[Phase]
Top
See Also
Reference
FamilyInstance Class
Autodesk.Revit.DB Namespace